{"id":"531f40155dde2219420002bc","title":"Review Policy","slug":"review-policy","url":"/review-policy","body":"Thanks for your interest in having me read and review your book. That's sweet of you and I'm flattered.\r\n\r\nI sort of accept books to review. And by that I mean reviewing books in exchange for the book is not the purpose of my blog so it's something I only do sporadically when I don't have a bunch of other stuff on my plate AND the book sounds super awesome. Most of the books I review are ones that I purchased myself. I'm not into blog tours or interviews, though I'm open to contests/giveaways.\r\n\r\n**\"Go on\" terms**\r\nIf you would describe your book using the following terms, I'd consider reviewing it:\r\n\r\n* Literary fiction\r\n* Dark humor\r\n* Sarcastic\r\n* Cynical\r\n* Absurd\r\n* Satirical \r\n* Christopher Moore-like\r\n* Jasper Fforde-esque\r\n\r\n**\"Deal breaker\" terms**\r\nIf you would describe your book using the following terms, you and I should probably go our separate ways and I wish you the best of luck:\r\n\r\n* Romance\r\n* Paranormal\r\n* Vampire\r\n* Erotic \r\n* Young Adult\r\n* Power of the human spirit \r\n* Chick-Lit\r\n* Nicholas Sparks-like\r\n* Jodi Piccoult-esque\r\n\r\nNow there's a chance you may see me review a book that could be described using one of those deal-breaker terms and be like \"hey! I thought you said you didn't review that!\" In case you do that, let me explain. I MAY read a book that can be described by those terms. I just won't accept a review copy of them. \r\n\r\n**Review requests**\r\nIf your book does fall into the \"go on\" section, please get in touch via the [Contact Page](/contact) and I'll let you know if I'm interested. I have a Kindle if you want to send me an e-copy. I can't promise a positive review but it will be my honest thoughts, so there's that. If you have a particular time frame you want the book reviewed in, let me know in the email but know that means I probably won't review it as I tend to read based on my mood, not a deadline. That said, I won't accept a book to review if I know I can't get to anytime in the (relatively) near future so I won't wait years to review it or anything.","visibility":"visible","created_at":"2014-03-11T16:55:49+00:00","updated_at":"2014-03-23T03:13:04+00:00","published_at":"2014-03-11T16:55:00+00:00","user_id":"5313b5405dde2224830001dc","site_id":"529f51115dde225c35000412","parent_id":null,"meta":[]}
