[{"id":"5313aeed5dde22a82e000067","title":"That there's a <em>besmirchin'</em>","slug":"that-theres-a-besmirchin","url":"/articles/that-theres-a-besmirchin","body":"As I may have mentioned [once](http://whatredread.blogspot.com/2011/03/authors-who-deserve-more-recognition.html) or [twice](http://whatredread.blogspot.com/2013/02/tuesday-top-ten-auto-buy-authors.html) (or [a million](http://whatredread.blogspot.com/2012/04/book-signings-or-there-will-be-bragging.html)) times before, I like Christopher Moore. A lot. So when Emily sent me an emailing saying she'd procured me a copy of Christopher Moore's latest book The Serpent of Venice AND got it signed for me, I may have done a stupid dance. She's pretty awesome, if you hadn't already guessed.\r\n\r\nI have been super excited for this book ever since Moore mentioned it while promoting his (at the time) latest book [Sacre Bleu](http://whatredread.blogspot.com/2012/05/artist-cant-let-madness-stop-him-from.html). Enough so when it was my turn to get my book signed and talk to him I mumbled some version of\r\n\r\n>\"yeah yeah, this current book I'm holding in my hand sounds good and all, but please tell me more about this Serpent of Venice you have in the works.\" \r\n\r\nAnd once I spoke up enough for him to hear, he was very nice and talked about how he had planned to write a bunch of it in iambic pentameter but do you know how hard that shit is? Very, is the answer. \r\n\r\nSerpent is the sequel to [Fool](http://whatredread.blogspot.com/2010/08/were-all-fates-bastards.html) which is one of my most favorite Moore books`1`. Fool is, essentially, King Lear but told from the Fool's point of view, with a little Macbeth thrown in. Serpent takes Pocket (aka the Fool) and sends him to Venice in a story that is basically a mash-up of The Merchant of Venice and Othello: The Moore of Venice, with a dash of Poe's \"The Count of Amontillado\". Now King Lear is not my favorite Shakespeare play, despite the number of times I've been forced to read it`2`, but you know what I do love? Fool. And while Merchant is also not a favorite of mine, Othello is, so the fact that Serpent is both is just peachy.\r\n\r\nAntonio, Brabantio, and Iago decide they need to get rid of the fool Pocket who seems to know too much and of course is just kind of annoying. Of course Pocket hasn't made it so long without a few attempts on his life, so he's pretty good at getting out of tight spots. Not to give too much away, but Pocket ends up on the doorstep of Shylock and his daughter Jessica, ready to begin his plan for revenge.\r\n\r\nOf course we have all of the elements of Merchant: the loan, the pound of flesh, Jessica running off with Shylock's jewels and turquoise ring to be with Antonio's buddy Lorenzo, Portia and her 3 caskets, \"the quality of mercy\" speech and the courtroom. And then there are the elements of Othello: Desdemona marrying Othello, Iago's manipulation, the Egyptian handkerchief, Cassio the light-weight. But if you haven't guessed, since we have lots of plays smooshed together, that things don't go quite as Shakespeare wrote. It all works out beautifully. And hilariously. The scenes between Iago and the Chorus are some of the best. And an explanation for why Iago always seems to be talking to himself.\r\n\r\nI always find writing about books I loved to be so much harder than books I hated. Or even just sorta \"meh\"-ed. And I loved this one. I had to force myself to read my Bleak House chapters/homework because I knew this was waiting for me. I tried to spread out the reading a little bit over the weekend, knowing I had a couple long train rides. And I failed because I NEEDED TO KEEP READING. And in terms of \"escape books\" (as in \"books that let me forget I'm on a crowded subway\") this one is way up there. I would look up and suddenly realize I was almost at my stop.\r\n\r\nNow I really want to re(re)read Fool. And then probably re-read this one.\r\n\r\n`1` Other favorite Moore books, because this post doesn't have enough links yet, [Lamb](http://whatredread.blogspot.com/2013/03/joshua-needs-friend-to-teach-him-to-be.html) (my most favoritest of my favorite books) and [A Dirty Job](http://whatredread.blogspot.com/2012/07/he-realized-with-no-little-sense-of.html). \r\n\r\n`2` And which I can't help but think every time \"Dammit, Cordelia. You can't just placate your dad for 2 minutes and exaggerate your love for him the tiniest bit? No? Fine, when everyone dies, it's kind of on your head.\"","visibility":"visible","created_at":"2014-03-02T22:21:33+00:00","updated_at":"2014-03-03T00:02:40+00:00","published_at":"2014-02-26T14:07:00+00:00","user_id":"5313b5405dde2224830001dc","site_id":"529f51115dde225c35000412","parent_id":"52ad0a9c5dde22956400010c","meta":[{"id":"5313b6f05dde22a7620000aa","key":"citation","value":"Title quote from page 10|Moore, Christopher. The Serpent of Venice. William Morrow/Harper Collins, 2014."},{"id":"5313b6f05dde22a7620000ab","key":"books","value":"18089900"}],"taxonomy":[{"id":"5313aeed5dde22a82e000068","key":"Tags","slug":"tags","values":[]}]},{"id":"5313b2545dde22a76200009e","title":"The one <em>great</em> principle of the English law is to <em>make business</em> for <em>itself</em>","slug":"the-one-great-principle-of-the-english-law-is-to-make-business-for-itself","url":"/articles/the-one-great-principle-of-the-english-law-is-to-make-business-for-itself","body":"Another Tuesday means another Bleak House post. Thank you [Alice](http://reading-rambo.blogspot.com/2014/02/bleak-house-week-4-esther-esther-esther.html) for hosting and also for spreading out the reading some more because we're all whiners.\r\n\r\nNow, to the random thoughts about chapters XXXIII - XXXIX\r\n\r\nGuppy's first name is William. Weevle/Jobling's first name is Tony. And they have an adorable \"And then Guppy said \"Who are YOU conspiring with?\" And then Jobling retorts \"Nuh huh!\" And then HE said \"well I won't take you to the spring fling*\" and then I said \"Well I'm going with Prince, so WHO CARES\" and then they broke up and it was on the quad and everyone saw.\r\n\r\nGeorge gave Tulkster the Hawdon handwriting sample because something debts for the Bagnets. I'm not entirely sure who the Bagnets are. I know they have hilariously named children and now I know they were in debt but aren't now because George made a minor deal with...not the devil but one of the lesser demons. Sorry, George. You seem very nice but your chapters are boring.\r\n\r\nEsther is all disfigured by smallpox (at least enough that Charley hid all of the mirrors) BUT not blind anymore so there's that. She then admits that she believes Woodcourt loves her (yeah, thanks for that, couldn't have guessed) but she's very happy that they didn't get engaged cos now she's all ugly and that would be unfair to him.\r\n\r\n![sherlockcries](/assets/sherlockcries.gif) \r\n\r\nI'd find this more tragic but now she can 100% go after Ada. Cos Ada won't care about any scarring. Because LOVE.\r\n\r\nAre there interpretations of Bleak House that don't talk about Esther being super in love with Ada? If so, how the hell do they argue that? I mean, other than badly.\r\n\r\n![trashfail](/assets/trashfail.gif) \r\n\r\nThe Lady D and Esther reunion was...anticlimactic. Dickens take 3 chapters to describe fog, but we get maybe 3 pages for the entire \"I'm your mother!\" \"Of course you are! I love you, mother!\" \"I love you too. But we may never speak again. I must be dead to you because of my reputation.\" \"Of course! Because I love you so much I shall keep your secret.\" \"OK. Bye then.\" \"Bye.\"\r\n\r\n![waitwhut](/assets/waitwhut.gif) \r\n\r\nWhat the hell? He describes them as sobbing and hugging each other and kissing and it seems emotional except the whole thing happens in a heartbeat and why did we speed right through that scene?\r\n\r\nRichard is being a jerk now, all wrapped up in the Jarndyce case. And yet I still didn't really mind him, until it was revealed he's been hanging out with Skimpole. No Richard. No. You've crossed the line now.\r\n\r\nGuppy agrees to quit digging into Esther's past in a scene that's sort of adorable when he keeps oscillating between talking to her and running back to the house. But then you remember the creepy stalking and go back to thinking he should just go away now.\r\n\r\nGrandfather Smallwood is digging through Krook's things, and Tulkinghorn is lurking in Nemo/Hawdon/Weevle's apartment making vague threats at Guppy. All this stuff about Tulkinghorn collecting secrets. He's Magnassen, right? I bet he's flicking faces too. The jerk.\r\n\r\n![magnussenknowingowning](/assets/magnussenknowingowning.gif) \r\n\r\nWhat will Tulkinghorn do with this information? Is he going to reveal Lady D's past? Or use the information to get something from her? What does he want? Is Richard going to keep being a dick (HA) about this J&J case? Will Esther and Ada finally just get together already omg??\r\n\r\nWhy yes, Mean Girls was on TV when I was taking some of my notes.\r\n\r\n**At least there's only one new character in this section\r\nMr. Vholes** - Richard's lawyer to help with the J&J case. Vholes whines a lot about how he does everything for his daughters. Also is very respectable because he has bad digestion and apparently those go together. Comments about how solid his commitment is by banging on a hollow desk, so...","visibility":"visible","created_at":"2014-03-02T22:36:04+00:00","updated_at":"2014-03-03T00:10:08+00:00","published_at":"2014-02-25T14:36:00+00:00","user_id":"5313b5405dde2224830001dc","site_id":"529f51115dde225c35000412","parent_id":"52ad0a9c5dde22956400010c","meta":[{"id":"5313b2545dde22a7620000a0","key":"citation","value":"Title quote from location 9397|Dickens, Charles. Bleak House. Amazon Digital Services. Originally published 1853. Kindle edition."},{"id":"5313b2545dde22a7620000a1","key":"books","value":"31242"}],"taxonomy":[{"id":"5313b2545dde22a76200009f","key":"Tags","slug":"tags","values":[]}]},{"id":"5313b3575dde22a82e00006b","title":"Wedding Update: Guestbook","slug":"wedding-update-guestbook","url":"/articles/wedding-update-guestbook","body":"![ring book](/assets/ring book.jpg) \r\n\r\nNow that the big wedding decisions are pretty much done, I thought maybe I'd have less updates. Not that I was ever really on fire with these things. But while all of the big stuff is done, I feel like there will probably be more to say about the little details. At the same time, I don't want to talk about EVERYTHING here, lest there is nothing at the wedding itself that's a surprise for the few people I know IRL that also visit my blog.\r\n\r\nSo far I think the only things I really don't want to reveal here are my dress and my first dance song. The dress because I don't want BF+ to see it before the wedding day (though he's going to see it before the ceremony cos I want pics done first so I can enjoy more of this cocktail hour because mmmm food) and the first dance song because I enjoy people trying to guess it.\r\n\r\nWhat I will tell you is our guest book idea. At least the current one.\r\n\r\nSee, at first we wanted to do a photo booth. They're fun and I'd love to have pictures of each person/group of people. The plan was people get their photos taken in the booth, they keep one copy of the photo strip and they glue the other down in a book and then they'll sign around it. Fun, right? Here's the thing. Photobooths are kind of expensive. And the space we're in isn't massive. They said they've done photobooths in there and it's been fine, but I fear it's going to be this thing in the way of the dance floor. So we decided to scrap that idea.\r\n\r\nWe could just do a book, of course. But eh. Seems boring and like something I'd never look at again. And if I won't look at it again, why should I make people sign it?\r\n\r\nWe thought about one of those [thumbprint canvas art dealies](http://www.etsy.com/search?q=thumbprint%20guestbook&view_type=gallery&ship_to=US&ref=auto4). I like the idea of having a piece of art to hang up. Of course the downside (or upside, I guess depending on your view) is people can't really write anything. The idea is guests leave their thumbprint and...that's it. I guess some I've seen have people sign their name but no messages. Which can be fine but if people WANT to write a message they sort of...can't. I haven't ruled this idea out entirely, but it's plan B at this point.\r\n\r\nPlan A is bookmarks. We'll print up blank bookmarks for guests to sign. This goes along with the (semi) bookish theme and more importantly, I get bookmarks. Which is actually why I thought of it. I was having trouble finding a bookmark, because I tend to leave them in books and can't always remember the last place I had it. I was likely also watching one of those TLC wedding shows and I thought I could just make everyone sign a bookmark and then I will be swimming in the things! BAM. Mom and I are looking for bookmark templates (which I'm pretty sure is just...a long rectangle? I don't know why bookmark templates are a thing) which we'll cut up. Now I need to think of somewhere for people to put the bookmarks once they've signed them. So they don't take them home. Which is FINE but sort of defeats the whole \"bookmark guest book\" idea. I'm thinking a shadowbox for people to put them in, but if anyone has any other ideas I AM OPEN TO THEM!","visibility":"visible","created_at":"2014-03-02T22:40:23+00:00","updated_at":"2014-03-02T23:01:31+00:00","published_at":"2014-02-23T15:10:00+00:00","user_id":"5313b5405dde2224830001dc","site_id":"529f51115dde225c35000412","parent_id":"52ad0a9c5dde22956400010c","meta":[],"taxonomy":[{"id":"5313b3575dde22a82e00006c","key":"Tags","slug":"tags","values":[]}]}]
